{
  "main": {
    "name": "Dre Graham",
    "description": "Cloud Computing | DevOps | Infrastructure as Code",
    "image": "profilepic.jpg",
    "bio": "I'm a Cloud Computing graduate with a strong background in technical support and hands-on experience across AWS and Azure environments. I specialize in troubleshooting, automation, and observability—using tools like CloudWatch, Sumo Logic, and Kibana to uncover and resolve complex infrastructure issues. With scripting experience in Python, PowerShell, and SQL, I focus on improving uptime, automating diagnostics, and streamlining workflows.\n\nI've collaborated closely with engineering, product, and security teams to strengthen reliability, enhance system transparency, and reduce resolution times. My passion lies in cloud operations and data-driven problem solving, and I'm continuously expanding my skills toward infrastructure automation and DevOps engineering.",
    "contactmessage": "Want to schedule a consultation or have a question? Reach out to me via email or by using the contact form below.",
    "email": "andre.graham709@gmail.com",
    "github": "https://github.com/dregraham",
    "address": {
      "city": "St. Louis",
      "state": "Missouri"
    },
    "website": "https://dregraham.com",
    "resumedownload": "Andre_Graham_Resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/dregraham/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/dregraham",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skills": [
  { "name": "AWS (EC2, Lambda, S3, DynamoDB, CloudWatch, IaC)", "level": "85%" },
  { "name": "Azure & GCP (Functions, DevOps, CosmosDB, Cloud Run)", "level": "60%" },
  { "name": "Programming & Scripting (Python, PowerShell, JavaScript, React, Bash, HTML/CSS, JSON/YAML)", "level": "85%" },
  { "name": "Infrastructure as Code & CI/CD (Terraform, CloudFormation, GitHub Actions, Azure DevOps)", "level": "75%" },
  { "name": "Monitoring & Observability (CloudWatch, Sumo Logic, Kibana)", "level": "85%" },
  { "name": "Databases (SQL Server, DynamoDB, Cosmos DB, RDS)", "level": "70%" },
  { "name": "Cross-Platform Systems (Linux, Windows, Networking, Security)", "level": "70%" }
]
,
    "education": [
      {
        "school": "Western Governors University",
        "degree": "B.S. in Cloud Computing",
        "graduated": "December 2025",
        "description": "Completed hands-on coursework in Cloud architecture, systems administration, networking, and cybersecurity. Gained experience with AWS and Azure, Linux and Windows server management, resource automation and scaling, and implementing DevOps practices including CI/CD and IaC. Applied ITIL and Agile methodologies in projects involving secure, scalable cloud deployments, database management, and system automation."
      }
    ],
    "work": [
      {
        "company": "Auctane",
        "title": "Technical Escalations Specialist, L3",
        "years": "May 2019 - Present",
        "description": "As a Technical Escalations Specialist L3, I lead complex technical escalations and serve as the highest tier of support. Building upon my experience with tools such as Kibana, Kubernetes, CloudWatch, DynamoDB, and SUMO, I architect comprehensive solutions for enterprise-scale challenges. I mentor L1-L2 specialists while collaborating directly with engineering teams to resolve critical system issues and develop permanent fixes. My expertise spans advanced SQL optimization, complex database architecture, and cloud-based monitoring systems, allowing me to drive technical innovation and process improvements across the entire Support organization."
      },
      {
        "company": "Auctane",
        "title": "Technical Support Specialist, L2",
        "years": "June 2017 - May 2019",
        "description": "Provided advanced technical support for ShipWorks shipping software, specializing in troubleshooting complex issues related to API integrations, database performance, and system infrastructure. Utilized tools such as Kibana, SUMO, and CloudWatch to diagnose and resolve customer problems efficiently. Collaborated closely with Product and Engineering teams to identify root causes and implement long-term solutions. Assisted in creating knowledge base articles and training materials using Confluence and Paligo to enhance Support SLA metrics and streamline troubleshooting efforts."
      },
      {
        "company": "Auctane",
        "title": "Technical Support Specialist, L1",
        "years": "June 2015 - May 2017",
        "description": "Delivered front-line technical support for customers using shipping and logistics software. Focused on resolving issues related to software functionality, user access, and basic API integrations. Worked closely with the engineering team to escalate and resolve more complex issues."
      } 
    ]
  },
  "projects": {
    "projectdetails": [
      {
        "title": "Cloud Health Dashboard",
        "category": "A simulated dashboard for monitoring cloud health and metrics.",
        "image": "CloudHealthBackground.jpg",
        "url": "/projects/cloud-health-dashboard"
      },
      {
        "title": "Multi-Cloud Automation (IaC)",
        "category": "Demonstrates infrastructure as code deployments across AWS and Azure using Terraform.",
        "image": "aws_azure_iac.png",
        "url": "/projects/multicloud-iac"
      },
      {
        "title": "Log Analyzer Toolkit",
        "category": "A toolkit for analyzing and visualizing log data.",
        "image": "analyze.jpg",
        "url": "/projects/log-analyzer-toolkit"
      }
    ]
  }
}